Revit 2027 API
ModelText.ModelTextType Property
The type for the model text.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ModelTextType ModelTextType { get; set; }
Public Property ModelTextType As ModelTextType
	Get
	Set
public:
property ModelTextType^ ModelTextType {
	ModelTextType^ get ();
	void set (ModelTextType^ value);
}
member ModelTextType : ModelTextType with get, set
Property Value
ModelTextType
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when null is assigned to this property.
See Also
Reference
ModelText Class
Autodesk.Revit.DB Namespace